Revit 2027 API
BuiltInFailures.ExtendedPropertiesLinkFailures.UnsupportedSchema Property
 The dataset contained a property definition that Revit does not support.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UnsupportedSchema { get; }
Public Shared ReadOnly Property UnsupportedSchema As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UnsupportedSchema {
	FailureDefinitionId^ get ();
}
static member UnsupportedSchema : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ExtendedPropertiesLinkFailures Class
Autodesk.Revit.DB Namespace